---
kind: type
id: T:Autodesk.Revit.Creation.eRefFace
source: html/900d9088-2ea5-1953-3b01-0c9cc141825a.htm
---
# Autodesk.Revit.Creation.eRefFace

Indicates the reference face. The Opening will be created at the direction perpendicular to
the reference face.

## Syntax (C#)
```csharp
public enum eRefFace
```

## Remarks
Direction of the opening.